<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"0a65248cebd65bbccae1e8ae08c4503af3d78da413606719b9fc726a763a6851","plan_job_ref":"Job Test terraform-refresh #90 at https://github.com/dflook/terraform-github-actions/actions/runs/23739200350","plan_out_hash":"f0f498c3bfec6760d3c27333055c8cdafcdd4235c6c4f4557a6e8e250e7e6c79","plan_hash":"100375b8db6d3fc909b2d4aa5401d72eca6ac7ac155e8f2fce05ab2c2ccad6c3","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Test terraform-refresh #90](https://github.com/dflook/terraform-github-actions/actions/runs/23739200350)